config.org
#+title: Doom Emacs Configuration
#+author: Prashant Tak
#+email: prashantrameshtak@gmail.com
#+startup: fold

:DOC-CONFIG:
#+property: header-args:emacs-lisp :tangle config.el
:END:

The first edition of my +soon-to-be+ literate configuration :P

1. NOTE: Run =org-babel-tangle= after making changes it to this file. Oddly enough, first time I had to run =doom sync=, need to look into this.
2. Look into =org-babel-demarcate-block= too.

* Todo
1. [X] Turn this into a literate Configuration
2. [ ] Improve the EXWM experience
3. [ ] Incorporate elvish and other configuration stuff within this.

* Config File Header
For the lexical binding of the elisp file.

#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
;; they are implemented.
#+END_SRC

* Hack to remove EXWM Warning
This is not functional since I moved from a single EXWM file to a personal doom EXWM module but might be useful in the future if I decide to scrap that idea.

#+BEGIN_SRC emacs-lisp
;;(eshell-command "setq stringvar $XDG_CURRENT_DESKTOP")
;;(if (string= stringvar "EXWM")
;;   (load! "+exwm")
;;nil
;;)
#+END_SRC

* Customized Variables
To avoid the issue of reproducing your customize options.

#+BEGIN_SRC emacs-lisp
(setq-default
 user-full-name "Prashant Tak"
 user-mail-address "prashantrameshtak@gmail.com"
 doom-font (font-spec :family "JetBrains Mono" :size 18) ;Nerd Font Mono
 doom-variable-pitch-font (font-spec :family "iA Writer Quattro S")
 doom-serif-font (font-spec :family "iA Writer Quattro S" :weight 'regular)
 doom-theme 'doom-dracula
 org-directory "/mnt/Data/Documents/org/"
 evil-escape-mode 1
 display-line-numbers-type 't
 tab-width 8
 which-key-idle-delay 0.5
 large-file-warning-threshold nil
 org-latex-toc-command "\\tableofcontents \\clearpage"
 )
#+END_SRC

Projectile default behaviour change * FIXME

#+begin_src emacs-lisp
;; (setq projectile-switch-project-action #'projectile-dired)
#+end_src

Disable background in emacs when opening terminal mode.

#+BEGIN_SRC emacs-lisp
(custom-set-faces! '(default :background nil))    
#+END_SRC

Highlighting the new buffer when you open one should be the default, let's make it that way.

#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+END_SRC

Add some highlighting to woman pages

#+BEGIN_SRC emacs-lisp
(add-hook 'Info-selection-hook 'info-colors-fontify-node)
(add-hook 'Info-mode-hook #'mixed-pitch-mode)
#+END_SRC

Ensuring that emacs is focused after restarting

#+BEGIN_SRC emacs-lisp
(add-hook! 'window-setup-hook
  (select-frame-set-input-focus (selected-frame)))
#+END_SRC

Also =doom/window enlargen= has some freezing issues, this HACK attempts to fix them for the time being.

#+BEGIN_SRC emacs-lisp
(setq window-resize-pixelwise nil
      frame-resize-pixelwise nil)
#+END_SRC

Company's completion dialog frame takes a long time to show up, making it look slow, hence we reduce the idle delay.

#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0.2))
#+END_SRC

Also, I don't need the details dired provides all the time, so I disabled that.

#+BEGIN_SRC emacs-lisp
(add-hook 'dired-mode-hook 'dired-hide-details-mode)
#+END_SRC

Now this somehow makes notes of the changes you made using the customize wizard, but I need to look into its working yet.

#+BEGIN_SRC emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+END_SRC

Zen mode increases font size which is annoying, let's disable that.

#+BEGIN_SRC emacs-lisp
(when (featurep! :ui zen)
  (after! writeroom-mode
    (setq +zen-text-scale 0)))
#+END_SRC

Let's make doom workspaces pesistent in the minibuffer, so we can easily keep track of them (minibuffer is wasted space anyways :p)

#+BEGIN_SRC emacs-lisp
;;(defun display-workspaces-in-minibuffer ()
;;  (with-current-buffer " *Minibuf-0*"
;;    (erase-buffer)
;;    (insert (+workspace--tabline))))
;;(run-with-idle-timer 1 t #'display-workspaces-in-minibuffer)
;;(+workspace/display)
#+END_SRC

Add a save and close keybinding.

#+begin_src emacs-lisp
(defun save-and-close ()
  (interactive)
  (call-interactively 'save-buffer)
  (call-interactively 'kill-current-buffer))

(map! :n "SPC b w" #'save-and-close)
#+end_src

Remove highlighting

#+begin_src emacs-lisp
(add-hook 'after-change-major-mode-hook
(lambda ()
(hl-line-mode -1)))
#+end_src

* Modeline
Modeline has lots of unnecessary information, let's remove that, also let's display battery and time.

#+BEGIN_SRC emacs-lisp

(display-time-mode 1)

(unless (equal "Battery status not available"
               (battery))
  (display-battery-mode 1))
#+END_SRC

* LSP
I've yet to look more into the different speed-up and configuration options related to LSP but these are some basics that I yanked off the discord.

#+BEGIN_SRC
(after! lsp-ui (setq lsp-ui-doc-enable t))
(after! lsp-mode (setq lsp-enable-semantic-highlighting t))
#+END_SRC

* Org
Now I need to make all these changes coherent and consistent but for the time being I'm just dumping them here.

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
(add-hook 'org-mode-hook
          (λ! (yas-minor-mode)
              (yas-activate-extra-mode 'latex-mode)))
;; (add-hook 'org-mode-hook 'lsp-completion-mode)
#+END_SRC

Org files should look beautiful while you're typing in them.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src

Nested snippets are useful, let's enable them.

#+BEGIN_SRC emacs-lisp
(setq yas-triggers-in-field t)
#+END_SRC

Flycheck annoys whenever I have to export to pdf, let's disable it for tex files.

#+BEGIN_SRC emacs-lisp
(setq flycheck-global-modes '(not LaTeX-mode latex-mode))
#+END_SRC

For plotting graphs, one needs tikz and pfgplots. let's enable them by default, also preview of tikz graphs would be cool too.

#+BEGIN_SRC emacs-lisp
(setq org-preview-latex-default-process 'dvisvgm)
#+END_SRC

Setting up agenda and capture

#+begin_src emacs-lisp
(setq org-agenda-start-with-log-mode t
      org-log-done 'time
      org-log-into-drawer t
      org-agenda-breadcrumbs-separator " ❱ ")

(setq org-agenda-files
      '("~/Dropbox/org/inbox.org"
        "~Dropbox/org/todo.org"))

(setq org-agenda-custom-commands
      '(("A" "My agenda"
         ((todo "TODO" (
                        (org-agenda-overriding-header "⚡ TODAY:\n")
                        (org-agenda-remove-tags t)
                        (org-agenda-prefix-format " %-15b")
                        (org-agenda-todo-keyword-format "")))
          (agenda "" (
                      (org-agenda-skip-scheduled-if-done t)
                      (org-agenda-skip-timestamp-if-done t)
                      (org-agenda-skip-deadline-if-done t)
                      (org-agenda-start-day "-1d")
                      (org-agenda-span 3)
                      (org-agenda-overriding-header "⚡ SCHEDULE:\n")
                      (org-agenda-remove-tags t)
                      (org-agenda-prefix-format " %-15b%t %s")
                      (org-agenda-todo-keyword-format "")
                      ;;         (org-agenda-time)
                      (org-agenda-current-time-string "⮜┈┈┈┈┈┈┈ now")
                      (org-agenda-scheduled-leaders '("" ""))
                      (org-agenda-deadline-leaders '("" ""))
                      (org-agenda-time-grid (quote ((today require-timed remove-match) (0800 1100 1400 1700 2000) "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈")))
                      )
                  )
          ;;          (todo "NEXT" (
          ;;                       (org-agenda-overriding-header "⚡ THIS WEEK:\n")
          ;;                        (org-agenda-prefix-format " %b")
          ;;                        (org-agenda-todo-keyword-format "")))
          ))))

(defun my-org-agenda-format-date-aligned (DATE)
  "Format a DATE string for display in the daily/weekly agenda, or timeline.
This function makes sure that dates are aligned for easy reading."
  (require 'cal-iso)
  (let* ((dayname (calendar-day-name DATE 1 nil))
         (day (cadr DATE))
         (month (car DATE))
         (monthname (calendar-month-name month 1))
         (year (nth 2 DATE)))
    (format " %-2s. %2d %s"
            dayname day monthname)))

(setq org-agenda-format-date 'my-org-agenda-format-date-aligned)

(setq org-agenda-block-separator (string-to-char " "))

(setq org-agenda-hidden-separator "‌‌ ")
#+end_src

* Elfeed
I need to add shortcuts for update functions and reference to the org file, also need to fix the database update issue.

#+BEGIN_SRC emacs-lisp
(after! elfeed
  (setq elfeed-search-filter "@2-month-ago"))
(defun =elfeed ()
  (interactive)
  (elfeed)
  )
(map! :n "SPC o e" #'=elfeed)
(after! elfeed
  (map! :n "u" #'elfeed-update))
#+END_SRC

